ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/system/system_task.c
#ifdef DCB
static m2m2_hdr_t *lt_app_lcfg_dcb_command_read_config(m2m2_hdr_t *p_pkt);
static m2m2_hdr_t *lt_app_lcfg_dcb_command_write_config(m2m2_hdr_t *p_pkt);
static m2m2_hdr_t *lt_app_lcfg_dcb_command_delete_config(m2m2_hdr_t *p_pkt);
#endif

/* To distinguish between stream_stop_resp/unsub_resp pkt received in s/m task
 * against the low touch specific stream_stop_resp/unsub_resp pkts */
volatile uint8_t gb_sensor_stop_cmds = 0;
/* Flag to Stop sensor streaming only if logging is not going on, otherwise only
 * Unsub */
volatile uint8_t gb_stop_streaming_if_no_logging = 0;
/* Flag to handle only Unsub command */
volatile uint8_t gb_unsub_only = 0;

/* To get info on all the sensor apps in Watch
   from M2M2_PM_SYS_COMMAND_GET_APPS_INFO_REQ
*/
static uint8_t gsSensorStatusPktBuf[sizeof(m2m2_pm_sys_sensor_apps_info_req_t)];
static m2m2_pm_sys_sensor_apps_info_req_t *gsSensorStatusRespPkt = NULL;
static uint8_t gsSensorAppsInfoPkt[M2M2_HEADER_SZ +
                                   sizeof(m2m2_pm_sys_sensor_apps_info_req_t)];
static m2m2_hdr_t *gsSensorAppsInfoHdr = NULL;
static m2m2_pm_sys_sensor_apps_info_req_t *gsSensorAppsInfoPayload = NULL;
/* To go through all sensor apps in the routing table */
static uint8_t gsPsAppNumber = 0;
/* No: of Active sensor apps */
static uint8_t gsActivePsAppCnt = 0;
/* Flag to specify that all slots within ADPD are being gone through
   from M2M2_ADDR_SENSOR_ADPD4000 sensor app, while GetSensorAppStatus() */
static uint8_t gnAdpdSensorApp = 0;
/* 20 -> max num of sensor apps in Watch; gets updated later from the actual
 * routing table */
static uint8_t gsRoutingTableSize = 20;
/* to hold the source address of the command */
static M2M2_ADDR_ENUM_t gsStausCmdSrcAddr = NULL;

extern g_state_t g_state;

#ifdef ENABLE_EDA_APP
extern volatile bool gEdaAppInitFlag;
#endif
#ifdef ENABLE_ECG_APP
extern volatile bool gEcgAppInitFlag;
#endif
#ifdef ENABLE_BCM_APP
extern volatile bool gBiaAppInitFlag;
#endif
void GetSensorAppsStatus();
void SendSensorStopCmds();
#ifdef ENABLE_WATCH_DISPLAY
extern void reset_display_vol_info();
#endif
#ifdef ENABLE_TEMP_DEBUG_STREAM
extern uint32_t batt_app_packet_count;
#endif
/* M2M2 address(ble/usb) from which Force stream stop/unsub REQ needs to be
 * given out; to be used from M2M2_PM_SYS_COMMAND_FORCE_STREAM_STOP_REQ */
static M2M2_ADDR_ENUM_t gnForceStopReqAddr = M2M2_ADDR_UNDEFINED;
/* Flag to handle whether ADXL sensor was 'start'ed to get raw
 * data(CLI_USB/CLI_BLE) or if it was started by internal applications like PPG
 */
extern uint8_t gb_adxl_raw_start_ppg;
/* Flag to handle whether ADPD sensor was 'start'ed to get raw
 * data(CLI_USB/CLI_BLE) or if it was started by internal applications like
 * PPG */
extern uint8_t gb_adpd_raw_start_ppg;
/* Flag to handle whether ADPD sensor was 'start'ed to get raw
 * data(CLI_USB/CLI_BLE) or if it was started by internal applications like
 * Temp */
extern uint8_t gb_adpd_raw_start_temp;
/* Flag to handle whether ADPD sensor was 'start'ed and multiple subscribers
* (more than 1) added to get raw data(CLI_USB/CLI_BLE) */
extern uint8_t gb_adpd_multi_sub_start;

/*To send the LT error responses */
extern M2M2_ADDR_ENUM_t usb_pkt_src;
extern M2M2_ADDR_ENUM_t ble_pkt_src;

#define ADI_PM_BAT_LEVEL_LOG_CRITICAL 1

/* LT config file name that resided in NAND Flash COnfig block */
uint8_t ConfigFileName[16] = "USER_CONFIG.LOG";

/* State machine variables for ON/OFF wrist events */
extern volatile LOW_TOUCH_DETECTION_STATUS_ENUM_t eCurDetection_State;

#if defined(MEASURE_BLE_ADV_TIME) && defined(CUST4_SM)
static volatile uint32_t gn_ble_ontime;
#endif

/*!
  ********************************************************************************
*    @brief Sends System task Alarm Notification Message to the Tool 

*    @param[in]  nAlarm  - This is of type M2M2_APP_COMMON_ALARM_STATUS_ENUM_t
*                             Alarm status could be low/critical/full
*    @return                - None
*
**********************************************************************************/
void SendSystemAlarmNtfMsg(M2M2_APP_COMMON_ALARM_STATUS_ENUM_t nAlarm) {
  m2m2_hdr_t *response_mail = NULL;
  ADI_OSAL_STATUS err;

  if (battery_level_alerts.tool_addr != M2M2_ADDR_UNDEFINED) {
    response_mail =
        post_office_create_msg(M2M2_HEADER_SZ + sizeof(_m2m2_app_common_cmd_t));
    if (response_mail != NULL) {
      _m2m2_app_common_cmd_t *battery_level_alarm_msg =
          (_m2m2_app_common_cmd_t *)&response_mail->data[0];

      /* send response packet */
      response_mail->src = M2M2_ADDR_SYS_PM;
      response_mail->dest = (M2M2_ADDR_ENUM_t)battery_level_alerts.tool_addr;
      response_mail->checksum = 0x0000;
      battery_level_alarm_msg->command =
          M2M2_APP_COMMON_CMD_ALARM_NOTIFICATION; /* Battery level Alarm Notification
                                              message*/
      battery_level_alarm_msg->status = nAlarm;
      post_office_send(response_mail, &err);
    }
  }
}

/*!
  ****************************************************************************
*    @brief Sends the reason for force stop log request
*
*    @param[in]                    - None
*    @return                       - FORCE_STOP_LOG_REASON_ENUM_t; returns the
*                                    reason for force stop log request
*                                    It can be either battery critical or 
*                                    power state shutdown command received
*
*****************************************************************************/

FORCE_STOP_LOG_REASON_ENUM_t getForceStopLogReason(void)
{
  return(gForceStopLogReason);
}

/*!
  ****************************************************************************
*    @brief resets the reason for force stop log request to E_INVALID
*
*    @param[in]                    - None
*    @return                       - None
*
*****************************************************************************/

void resetForceStopLogReason(void)
{
  gForceStopLogReason = E_INVALID;
}
/*!
  ****************************************************************************
*    @brief Sends Battery Level Alert Message to the Tool Registered

*    @param[in]                    - M2M2_PM_SYS_STATUS_ENUM_t
*    nAlertMsg                     - battery level status enum could be
                                     low/critical
*    @return                       - None

*****************************************************************************/
static void SendBatteryLevelAlertMsg(M2M2_PM_SYS_STATUS_ENUM_t nAlertMsg) {
  m2m2_hdr_t *response_mail = NULL;
  ADI_OSAL_STATUS err;

#ifndef CUST4_SM
  if (battery_level_alerts.tool_addr != M2M2_ADDR_UNDEFINED) {
#endif
    response_mail =
        post_office_create_msg(M2M2_HEADER_SZ + sizeof(m2m2_pm_sys_cmd_t));
    if (response_mail != NULL) {
      m2m2_pm_sys_cmd_t *battery_level_alert_msg =
          (m2m2_pm_sys_cmd_t *)&response_mail->data[0];

      /* send response packet */
      response_mail->src = M2M2_ADDR_SYS_PM;
#ifdef CUST4_SM
      response_mail->dest = M2M2_ADDR_GLOBAL;
#else
      response_mail->dest = (M2M2_ADDR_ENUM_t)battery_level_alerts.tool_addr;
#endif
      response_mail->length = 10;
      response_mail->checksum = 0x0000;
      battery_level_alert_msg->command =
          M2M2_PM_SYS_BATTERY_LEVEL_ALERT; /* Battery Alert Asynchronous
                                              message*/
      battery_level_alert_msg->status = nAlertMsg;
      post_office_send(response_mail, &err);
    }
#ifndef CUST4_SM
  }
#endif
}

/* RAM buffer which hold a copy of either DCB/NAND config file which has LT
 * start/stop sequence of commands
 * This buffer is to be reused between holding the copy of LT config file
 * as well as temporary storage for DCB content during READ/WRITE DCB block
 * for ADPD, Gen block DCB
 * NAND config file size = 1 page size = 4096 bytes.
 * Gen block DCB size, with MAX_GEN_BLK_DCB_PKTS=18 pkts,
 * each having 57 * 4 bytes = 4104 bytes.
 * ADPD4000 DCB size, with MAX_ADPD4000_DCB_PKTS=4 pkts,
 * each having 57 * 4 bytes = 912 bytes.
 * In the below array size definition, maximum of the above is chosen.
 */
uint32_t gsConfigTmpFile[MAXGENBLKDCBSIZE * MAX_GEN_BLK_DCB_PKTS];

#ifdef LOW_TOUCH_FEATURE
#define MAX_CMD_RETRY_CNT 5
#define MAX_FILE_COUNT 62
#define MAX_USABLE_MEMORY_SIZE 536868864
/* // M2M2_HEADER_SZ + sizeof(m2m2_file_sys_user_cfg_summary_pkt_t) */
#define CONFIG_FILE_SUMMARY_PKT_SIZE    20
#define STATUS_VALID 1
#define STATUS_INVALID 0
//#define LOW_TOUCH_FORCE_STOP_LOG            1//To force stop the regular/ Low
// touch logging on Button A event

/* Variable which holds the status LT app/logging running or not */
uint8_t gLowTouchRunning = 0;
/* Flag to enable FS task to send RESP to sysmte task */
uint8_t gSendRespToPmApp = 0;
/* Indicate the availability of config file copy in the RAM */
uint8_t gsCfgCopyAvailable = 0;
/* Flag to start sending LT command sequence */
static uint8_t gsSendNextConfigCmd = 0;
/* Variable to hold start or stop commands end point */
static uint32_t gsConfigFileSize = 0;
/* Variable to track no: of cmds currently executed in either Start/Stop LT
 * sequence */
static uint32_t gsNumOfCommands = 0;
/* Variable to update the read file pointer, with pkt len for a command that was
 * read & executed from Start/Stop LT sequence */
static uint16_t gsPktLenCopy = 0;
/* Variable pointer to hold start(head) of either Start/Stop LT sequence of
 * commands */
static uint8_t *gsConfigFileHeadPtr = NULL;
/* Variable pointer to hold end(tail) of either Start/Stop LT sequence of
 * commands */
static uint8_t *gsConfigFileTailPtr;
/* Variable pointer to read a command from either Start/Stop LT sequence of
 * commands */
static uint8_t *gsConfigFileReadPtr;
/* Variable pointer to extract control command from either Start/Stop LT
 * sequence of commands */
static _m2m2_app_common_cmd_t *gsConfigCtrl =
    NULL; //(_m2m2_app_common_cmd_t*)&pkt->data[0];
/* Variable pointer to extract m2m2 header info from either Start/Stop LT
 * sequence of commands */
static m2m2_hdr_t *gsConfigCmdHdr = NULL;
/* Debug variables used in ValidateStatus() api*/
static uint8_t gsStartStatusCnt = 0, gsSubStatusCnt = 0, gsfslogStatusCnt = 0,
               gsCommonStatusCnt = 0, gsCmdRetryCnt = 0;
/* Variable to hold the index where DCB/NAND config file is to be written to */
static uint16_t gsCfgWrIndex = 0;
/* Variable pointer which holds the summary info on the DCB/NAND config file
 * which has LT start/stop sequence of commands */
static m2m2_file_sys_user_cfg_summary_pkt_t *gsCfgFileSummaryPkt = NULL;
/* Variable which indicates whether LT Start or Stop sequence of cmds is being
 * executed currently */
static uint8_t gsStartCmdsRunning = 0, gsStopCmdsRunning = 0;
struct _low_touch_info {
  M2M2_ADDR_ENUM_t tool_addr; /*Tool Address*/
  uint8_t cmd;                /*Command sent from tool*/
} low_touch_info;

/*!
 ****************************************************************************
 * @brief   Initialize the low touch configuration paramteres
 * @param    nStart:  1 - to start LT Start sequence, 0 - to start the LT stop
 * sequence
 * @retval   None
 ******************************************************************************/
void InitConfigParam(bool_t nStart) {

  uint8_t *gsConfigTmpFile_ptr = (uint8_t *)&gsConfigTmpFile[0];

