ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/system/system_task.c
  //    MCU_HAL_Delay(10);
  while (gsConfigFileReadPtr < gsConfigFileTailPtr) {
#if LOW_TOUCH_DEBUG
    if (gsNumOfCommands > 23) {
      gsSendNextConfigCmd = 0;
      break;
    }
#endif // LOW_TOUCH_DEBUG
    gsConfigCmdHdr = (m2m2_hdr_t *)gsConfigFileReadPtr;
    gsConfigCmdHdr->src = M2M2_ADDR_SYS_PM;
    // if(!IsCfgCopyAvailable())
    //{

    // gsConfigCmdHdr->src =
    // (M2M2_ADDR_ENUM_t)BYTE_SWAP_16(gsConfigCmdHdr->src);
    gsConfigCmdHdr->dest = (M2M2_ADDR_ENUM_t)BYTE_SWAP_16(gsConfigCmdHdr->dest);
    gsConfigCmdHdr->length = BYTE_SWAP_16(gsConfigCmdHdr->length);
    gsConfigCmdHdr->checksum = BYTE_SWAP_16(gsConfigCmdHdr->checksum);
    //}
    gsPktLenCopy = gsConfigCmdHdr->length;
    gsConfigCtrl = (_m2m2_app_common_cmd_t *)&gsConfigCmdHdr->data[0];
    pkt = post_office_create_msg(gsConfigCmdHdr->length);
    if (pkt != NULL) {
      memcpy(pkt, gsConfigCmdHdr, gsConfigCmdHdr->length);
      NRF_LOG_HEXDUMP_INFO(gsConfigCmdHdr, gsConfigCmdHdr->length);
      gsSendNextConfigCmd = 0;
      post_office_send(pkt, &err);
      break;
    }
  }
}
#endif // LOW_TOUCH_FEATURE

/* counters for tracking the number of stop command sent, Unsub cmd sent
 * and senor applications respecively*/
static uint8_t gsSensorStopCnt = 0, gsSensorSubCnt = 0, gsSensorAppsCnt = 0;

/*!
 ****************************************************************************
 * @brief   Sends the sensor unsubscribe, stop commands to each of the sensor
 *          applications based on their sensor start count
 * @param    None
 * @retval   None
 ******************************************************************************/
void SendSensorStopCmds() {
  m2m2_hdr_t *pkt = NULL;
  ADI_OSAL_STATUS err;
  uint8_t nAdvanceToNextApp = 0, nSendStopCmd = 0;

  while (
      gsSensorAppsCnt <
      gsSensorStatusRespPkt
          ->num_sensor_apps) /*Send sensor stop cmds to all sensor applications
                                on PS till the start count becomes zero */
  {
    nAdvanceToNextApp = 0;
    /* send the [num_start_reqs] number of stop commands OR
     * [num_subscribers] number of unsub commands to the sensor
     * application{app_info[gsSensorAppsCnt].sensor_app_id}*/
    while (gsSensorStopCnt <
           gsSensorStatusRespPkt->app_info[gsSensorAppsCnt].num_start_reqs ||
           gsSensorSubCnt <
           gsSensorStatusRespPkt->app_info[gsSensorAppsCnt].num_subscribers
           ) {
      NRF_LOG_INFO("gsSensorAppsCnt:%d gsSensorSubCnt:%d, gsSensorStopCnt:%d",gsSensorAppsCnt,gsSensorSubCnt, gsSensorStopCnt);
      pkt = post_office_create_msg(
          M2M2_HEADER_SZ + sizeof(_m2m2_app_common_cmd_t));
      if (pkt != NULL) {
        m2m2_app_common_sub_op_t *payload =
            (m2m2_app_common_sub_op_t *)&pkt->data[0];

        if (!gb_stop_streaming_if_no_logging) {
          NRF_LOG_INFO("No logging check required");
          nSendStopCmd = 1;
          gb_sensor_stop_cmds = 1;
          payload->command = M2M2_APP_COMMON_CMD_STREAM_STOP_REQ;
          payload->status = M2M2_APP_COMMON_STATUS_OK;
          pkt->src = M2M2_ADDR_SYS_PM;
          pkt->dest =
              gsSensorStatusRespPkt->app_info[gsSensorAppsCnt].sensor_app_id;
          post_office_send(pkt, &err);
        }
        // If logging is in progress, send Unsubscribe sensor stream instead of
        // Sensor Stop
        else {
          NRF_LOG_INFO("Logging check required");
          if (gsSensorStatusRespPkt->app_info[gsSensorAppsCnt].fs_sub_stat ==
              M2M2_FILE_SYS_SUBSCRIBED) {
            NRF_LOG_INFO("FS subscribed");
            if (gsSensorStatusRespPkt->app_info[gsSensorAppsCnt]
                    .num_subscribers > 1) {
              nSendStopCmd = 1;
              gsSensorSubCnt++;  //Handle sub cnt for FS
              gsSensorStopCnt++; //Handle sensor start count for FS
              NRF_LOG_DEBUG("Force Sensor Unsub Given, since Logging is in "
                            "progress for %x",
                  gsSensorStatusRespPkt->app_info[gsSensorAppsCnt]
                      .sensor_app_id);
              gb_sensor_stop_cmds = 1;
              payload->command = M2M2_APP_COMMON_CMD_STREAM_UNSUBSCRIBE_REQ;
              payload->status = M2M2_APP_COMMON_STATUS_OK;
              payload->stream = gsSensorStatusRespPkt->app_info[gsSensorAppsCnt]
                        .sensor_stream;
              pkt->src = M2M2_ADDR_SYS_PM;
              pkt->dest = gsSensorStatusRespPkt->app_info[gsSensorAppsCnt]
                              .sensor_app_id;
              gb_unsub_only = 1;
              post_office_setup_subscriber(pkt->dest,
                  gsSensorStatusRespPkt->app_info[gsSensorAppsCnt]
                      .sensor_stream,
                  gnForceStopReqAddr, false);
              if (pkt->dest == M2M2_ADDR_MED_PPG) {
                post_office_setup_subscriber(pkt->dest,
                    M2M2_ADDR_MED_SYNC_ADPD_ADXL_STREAM, gnForceStopReqAddr,
                    false);
              }
              post_office_send(pkt, &err);
            } else {
              //m2m2_hdr_t *pkt unused, so free it
              NRF_LOG_INFO("No sub count");
              post_office_consume_msg(pkt);
            }
          }
          // No logging in progress
          else {
            NRF_LOG_INFO("No FS sub count");
            uint8_t pkt_used = 0; //Flag to track usage of m2m2_hdr_t *pkt, to free it properly

            if ( gsSensorStatusRespPkt->app_info[gsSensorAppsCnt]
                        .num_subscribers >= 1) {

              nSendStopCmd = 1;
              gb_unsub_only = 1;
              pkt_used = 1;

              NRF_LOG_DEBUG("sub cnt >= 1, Force Unsub given for %x",
                  gsSensorStatusRespPkt->app_info[gsSensorAppsCnt]
                      .sensor_app_id);
              gb_sensor_stop_cmds = 1;
              payload->command = M2M2_APP_COMMON_CMD_STREAM_UNSUBSCRIBE_REQ;
              payload->status = M2M2_APP_COMMON_STATUS_OK;
              payload->stream = gsSensorStatusRespPkt->app_info[gsSensorAppsCnt]
                        .sensor_stream;
              pkt->src = M2M2_ADDR_SYS_PM;
              pkt->dest = gsSensorStatusRespPkt->app_info[gsSensorAppsCnt]
                              .sensor_app_id;
              post_office_setup_subscriber(pkt->dest,
                  gsSensorStatusRespPkt->app_info[gsSensorAppsCnt]
                      .sensor_stream,
                  gnForceStopReqAddr, false);
              // Handle Unsub of sync adpd adxl stream separately
              if (pkt->dest == M2M2_ADDR_MED_PPG) {
                post_office_setup_subscriber(pkt->dest,
                    M2M2_ADDR_MED_SYNC_ADPD_ADXL_STREAM, gnForceStopReqAddr,
                    false);
              }
              post_office_send(pkt, &err);
            } if (gsSensorStatusRespPkt->app_info[gsSensorAppsCnt]
                        .num_start_reqs >= 1) {
                m2m2_hdr_t *pkt1 = NULL;

                /* Skip Sensor Stop if gb_adxl_raw_start_ppg/gb_adpd_raw_start_ppg/
                   gb_adpd_raw_start_temp is not set OR
                   gb_adpd_multi_sub_start is set*/
                if (((M2M2_ADDR_SENSOR_ADXL ==
                       gsSensorStatusRespPkt->app_info[gsSensorAppsCnt]
                           .sensor_app_id) &&
                      !gb_adxl_raw_start_ppg) ||
                  ((M2M2_ADDR_SENSOR_ADPD4000 ==
                       gsSensorStatusRespPkt->app_info[gsSensorAppsCnt]
                           .sensor_app_id) &&
                      !gb_adpd_raw_start_ppg) ||
                  ((M2M2_ADDR_SENSOR_ADPD4000 ==
                       gsSensorStatusRespPkt->app_info[gsSensorAppsCnt]
                           .sensor_app_id) &&
                      !gb_adpd_raw_start_temp) ||
                  ((M2M2_ADDR_SENSOR_ADPD4000 ==
                       gsSensorStatusRespPkt->app_info[gsSensorAppsCnt]
                           .sensor_app_id) &&
                      gb_adpd_multi_sub_start)) {
                  NRF_LOG_INFO(
                    "Force Stream stop skipped(not raw sensor start) for %x",
                    gsSensorStatusRespPkt->app_info[gsSensorAppsCnt]
                        .sensor_app_id);
                  gsSensorStopCnt++; //Handle sensor start count for raw sensor start case
                  if(!nSendStopCmd) {
                    NRF_LOG_DEBUG("Consuming pkt");
                    post_office_consume_msg(pkt);
                  }
                  break;
                }

                nSendStopCmd = 1;
                gb_unsub_only = 0;

                NRF_LOG_DEBUG("start cnt >= 1; Force Sensor Stop Given for %x",
                    gsSensorStatusRespPkt->app_info[gsSensorAppsCnt]
                        .sensor_app_id);
                pkt1 = post_office_create_msg(
                    M2M2_HEADER_SZ + sizeof(_m2m2_app_common_cmd_t));
                if(pkt1 != NULL) {
                  m2m2_app_common_sub_op_t *payload =
                      (m2m2_app_common_sub_op_t *)&pkt1->data[0];

                  gb_sensor_stop_cmds = 1;
                  payload->command = M2M2_APP_COMMON_CMD_STREAM_STOP_REQ;
                  payload->status = M2M2_APP_COMMON_STATUS_OK;
                  pkt1->src = M2M2_ADDR_SYS_PM;
                  pkt1->dest = gsSensorStatusRespPkt->app_info[gsSensorAppsCnt]
                                  .sensor_app_id;
                  post_office_send(pkt1, &err);
                }

            }  if (!nSendStopCmd || pkt_used == 0) {
              //m2m2_hdr_t *pkt unused, so free it
              NRF_LOG_INFO("stream start < 1 or sub count < 1 or unused pkt");
              post_office_consume_msg(pkt);
            }
          } /* else of if (gsSensorStatusRespPkt->app_info[gsSensorAppsCnt].fs_sub_stat ==
              M2M2_FILE_SYS_SUBSCRIBED) */
        }//else of if (!gb_stop_streaming_if_no_logging)
        break;
      } // end of if(pkt != NULL)
    }   /* end of while (gsSensorStopCnt <
           gsSensorStatusRespPkt->app_info[gsSensorAppsCnt].num_start_reqs ||
           gsSensorSubCnt <
           gsSensorStatusRespPkt->app_info[gsSensorAppsCnt].num_subscribers */

    if (nSendStopCmd) {
      NRF_LOG_INFO("Breaking");
      nSendStopCmd = 0;
      break;
    } else {
      NRF_LOG_INFO("Advancing to next sensor");
      nAdvanceToNextApp = 1;
      gsSensorAppsCnt++; /* num_start_reqs is equal to number of stop cmds
                            sent[gsSensorStopCnt] OR
                            num_subscribers is equal to number of unsub cmds
                            sent[gsSensorSubCnt], move onto next sensor app*/
      gsSensorStopCnt =
          0; /*clear the sensor stop cmd cnt for the next sensor application*/
     gsSensorSubCnt =
          0; /*clear the sensor sub cmd cnt for the next sensor application*/
    }
  } // end of while (gsSensorAppsCnt < gsSensorStatusRespPkt->num_sensor_apps)

  if (nAdvanceToNextApp) {
    gsSensorAppsCnt = 0;
    gsSensorStopCnt = 0;
    gsSensorSubCnt = 0;
#ifdef LOW_TOUCH_FEATURE
      if (!gb_stop_streaming_if_no_logging) {
        /* All sensor applications are stopped;
          send out the response */
        SendLowTouchErrResp(M2M2_PM_SYS_STATUS_USER_CONFIG_LOG_DISABLED);
        SendSystemAlarmNtfMsg(M2M2_APP_COMMON_ALARM_STATUS_USER_CONFIG_LOG_DISABLED);
      }
#endif
  }
  gb_stop_streaming_if_no_logging = 0;
}

/*!
 ****************************************************************************
 * @brief   Send Force stop streaming request to the All tasks
 * @param    None
 * @retval   None
 ******************************************************************************/
void SendForceStopStreaming() {
  // Stop sensor streaming only if logging is not going on, otherwise only Unsub
  gb_stop_streaming_if_no_logging = 1;
  GetSensorAppsStatus();
}

/*!
 ****************************************************************************
 * @brief   Sends the cmd for getting all the sensor application status
 * @param    None
 * @retval   None
 ******************************************************************************/
void GetSensorAppsStatus() {
  m2m2_hdr_t *pkt = NULL;
  ADI_OSAL_STATUS err;

  pkt = post_office_create_msg(M2M2_HEADER_SZ + sizeof(_m2m2_app_common_cmd_t));
  if (pkt != NULL) {
    _m2m2_app_common_cmd_t *payload = (_m2m2_app_common_cmd_t *)&pkt->data[0];
    payload->command = M2M2_PM_SYS_COMMAND_GET_APPS_INFO_REQ;
    payload->status = M2M2_APP_COMMON_STATUS_OK;
    pkt->src = M2M2_ADDR_SYS_PM;
    pkt->dest = M2M2_ADDR_SYS_PM;
    post_office_send(pkt, &err);
  }
}

/*!
 ****************************************************************************
 *@brief  Update the g_system_info structure with ble mac address
 *
 * @param None
 * @return None
 ******************************************************************************/
void update_ble_system_info() {
  ble_gap_addr_t ble_addr_t;
  int i;
  sd_ble_gap_addr_get(&ble_addr_t);

  for (i = 0; i < BLE_GAP_ADDR_LEN; i++)
    g_system_info.mac_addr[i] = ble_addr_t.addr[BLE_GAP_ADDR_LEN-1-i];
}

#ifdef USER0_CONFIG_APP
/*!
 ****************************************************************************
 * @brief  Update the g_system_info structure with hardware id
 *
 * @param hw_id: hardware id to be updated the g_system_info structure contents
                 with
 * @return None
 ******************************************************************************/
void update_hw_id_in_system_info(uint16_t hw_id) {
  g_system_info.hw_id = hw_id;
}
#endif
/*!
 ****************************************************************************
 * @brief System task init function.
 ******************************************************************************/
void system_task_init(void) {
  ADI_OSAL_STATUS eOsStatus;

