ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/system/system_task.c
        /*Check if GetVersion is requested by valid Tool Entity*/
        if ((pkt->src >= M2M2_ADDR_APP_DROID) &&
            (pkt->src <= M2M2_ADDR_APP_CLI_BLE))
          battery_level_alerts.tool_addr = pkt->src;
        post_office_consume_msg(pkt);
        break;
      }

      case M2M2_PM_SYS_COMMAND_SET_BAT_THR_REQ: {
        m2m2_pm_sys_bat_thr_req_t *bat_thr_req =
            (m2m2_pm_sys_bat_thr_req_t *)&pkt->data[0];
        response_mail = post_office_create_msg(
            M2M2_HEADER_SZ + sizeof(_m2m2_app_common_cmd_t));
        if (response_mail != NULL) {
          _m2m2_app_common_cmd_t *batt_thr_resp =
              (_m2m2_app_common_cmd_t *)&response_mail->data[0];

          /* Set battery critical and low levels */
          battery_level_alerts.level_low = bat_thr_req->bat_level_low;
          battery_level_alerts.level_critical = bat_thr_req->bat_level_critical;
          //Reset other fields in the structure
          //battery_level_alerts.tool_addr = M2M2_ADDR_UNDEFINED;
          battery_level_alerts.charge_alert_status = E_NORMAL_LEVEL;
          //battery_level_alerts.critical_level_flag = 0;

          /* send response packet */
          response_mail->src = pkt->dest;
          response_mail->dest = pkt->src;
          batt_thr_resp->command =
              (M2M2_APP_COMMON_CMD_ENUM_t)M2M2_PM_SYS_COMMAND_SET_BAT_THR_RESP;
          batt_thr_resp->status =
              (M2M2_APP_COMMON_STATUS_ENUM_t)M2M2_PM_SYS_STATUS_OK;
          post_office_send(response_mail, &err);
        }
        post_office_consume_msg(pkt);
        break;
      }
#ifdef TO_BE_USED
      case M2M2_PM_SYS_COMMAND_ENABLE_BAT_CHARGE_REQ: {
        response_mail = post_office_create_msg(
            M2M2_HEADER_SZ + sizeof(_m2m2_app_common_cmd_t));
        if (response_mail != NULL) {
          _m2m2_app_common_cmd_t *resp_payload =
              (_m2m2_app_common_cmd_t *)&response_mail->data[0];

          /* send response packet */
          response_mail->src = pkt->dest;
          response_mail->dest = pkt->src;
          resp_payload->command = (M2M2_APP_COMMON_CMD_ENUM_t)
              M2M2_PM_SYS_COMMAND_ENABLE_BAT_CHARGE_RESP;

          /* Enable battery charge */
          if (Adp5360_enable_batt_charging(true) == ADP5360_SUCCESS) {
            resp_payload->status =
                (M2M2_APP_COMMON_STATUS_ENUM_t)M2M2_APP_COMMON_STATUS_OK;
          } else {
            resp_payload->status =
                (M2M2_APP_COMMON_STATUS_ENUM_t)M2M2_APP_COMMON_STATUS_ERROR;
          }
          post_office_send(response_mail, &err);
        }

        post_office_consume_msg(pkt);
        break;
      }
      case M2M2_PM_SYS_COMMAND_DISABLE_BAT_CHARGE_REQ: {
        response_mail = post_office_create_msg(
            M2M2_HEADER_SZ + sizeof(_m2m2_app_common_cmd_t));
        if (response_mail != NULL) {
          _m2m2_app_common_cmd_t *resp_payload =
              (_m2m2_app_common_cmd_t *)&response_mail->data[0];

          /* send response packet */
          response_mail->src = pkt->dest;
          response_mail->dest = pkt->src;
          resp_payload->command = (M2M2_APP_COMMON_CMD_ENUM_t)
              M2M2_PM_SYS_COMMAND_DISABLE_BAT_CHARGE_RESP;

          /* Disable battery charge */
          if (Adp5360_enable_batt_charging(false) == ADP5360_SUCCESS) {
            resp_payload->status =
                (M2M2_APP_COMMON_STATUS_ENUM_t)M2M2_APP_COMMON_STATUS_OK;
          } else {
            resp_payload->status =
                (M2M2_APP_COMMON_STATUS_ENUM_t)M2M2_APP_COMMON_STATUS_ERROR;
          }
          post_office_send(response_mail, &err);
        }
        post_office_consume_msg(pkt);
        break;
      }
#endif
      case M2M2_PM_SYS_COMMAND_SET_PWR_STATE_REQ: {
        m2m2_pm_sys_pwr_state_t *power_state =
            (m2m2_pm_sys_pwr_state_t *)&pkt->data[0];
#ifdef USE_FS
        if (power_state->state == M2M2_PM_SYS_PWR_STATE_HIBERNATE ||
            power_state->state == M2M2_PM_SYS_PWR_STATE_SHUTDOWN) {
          /* If File logging is in progress */
          if (fs_hal_write_access_state() == FS_FILE_ACCESS_IN_PROGRESS) {
            /* Force Stop Logging */
            gForceStopLogReason = E_PWR_STATE_SHUTDOWN;
            response_mail = post_office_create_msg(
                M2M2_HEADER_SZ + sizeof(_m2m2_app_common_cmd_t));
            if (response_mail != NULL) {
              _m2m2_app_common_cmd_t *payload =
                  (_m2m2_app_common_cmd_t *)&response_mail->data[0];
              payload->command = (M2M2_APP_COMMON_CMD_ENUM_t)
                  M2M2_FILE_SYS_CMD_FORCE_STOP_LOG_REQ;
              response_mail->src = M2M2_ADDR_SYS_PM;
              response_mail->dest = M2M2_ADDR_SYS_FS;
              post_office_send(response_mail, &err);
            }
          }
        }
#endif
        response_mail = post_office_create_msg(
            M2M2_HEADER_SZ + sizeof(m2m2_pm_sys_pwr_state_t));
        if (response_mail != NULL) {
          m2m2_pm_sys_pwr_state_t *set_power_resp =
              (m2m2_pm_sys_pwr_state_t *)&response_mail->data[0];

          /* send response packet */
          response_mail->src = pkt->dest;
          response_mail->dest = pkt->src;
          set_power_resp->command = (M2M2_APP_COMMON_CMD_ENUM_t)
              M2M2_PM_SYS_COMMAND_SET_PWR_STATE_RESP;
          set_power_resp->status =
              (M2M2_APP_COMMON_STATUS_ENUM_t)M2M2_PM_SYS_STATUS_OK;
          set_power_resp->state = power_state->state;
          post_office_send(response_mail, &err);
          /* Wait for 250ms, to let alarm packet from FS task and PWR state response packet from 
          System task to reach the tool before entering into power mode*/
          vTaskDelay(250);

          /* Same as Power off from Watch display page. */
          if (power_state->state == M2M2_PM_SYS_PWR_STATE_HIBERNATE) {
            /* In Watch Hibernate / power off mode ADP5360 would be still
               active, we configure a GPIO for wake up with a timer for 1s
               button press wakeup and MCU enters into WFE. When it detects
               this press, it just calls the NVIC system reset */
            enter_poweroff_mode();
          }
          /* Same as the Shipment Mode from Watch display page.
             To see it in action, Watch needs to be removed from a USB connection.
             Only then it will enter shipment mode. To bring the Watch up, you need to plug in the USB cable.
          */
          else if (power_state->state == M2M2_PM_SYS_PWR_STATE_SHUTDOWN) {
            /* When Watch is in Shipment mode, ADP5360 will be powered down as well,
               thats why USB cable needs to be plugged in come out of it */
            Adp5360_enter_shipment_mode();
          }
          else if(power_state->state == M2M2_PM_SYS_PWR_STATE_ACTIVE) {
            //Watch is already in active mode, Do nothing
          }
          else {
            //Unsupported state
            set_power_resp->status =
              (M2M2_APP_COMMON_STATUS_ENUM_t)M2M2_PM_SYS_STATUS_ERR_ARGS;
          }
        }
        post_office_consume_msg(pkt);
        break;
      }

#ifdef USE_FS
      case M2M2_PM_SYS_COMMAND_FLASH_RESET_REQ: {
        response_mail = post_office_create_msg(
            M2M2_HEADER_SZ + sizeof(m2m2_file_reset_cmd_t));
        if (response_mail != NULL) {
          m2m2_file_reset_cmd_t *format_resp =
              (m2m2_file_reset_cmd_t *)&response_mail->data[0];
          /* Switch on and mount memory */
          fs_flash_power_on(true);

