ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/system/system_task.c
          /* Format memory partition */
          /*Deletes only the data files; preserves config files*/
          if (fs_hal_flash_reset() == FS_STATUS_ERR) {
            format_resp->status = M2M2_PM_SYS_ERR_RESET;
          } else {
#ifdef ENABLE_WATCH_DISPLAY
            reset_display_vol_info();
#endif
            format_resp->status = M2M2_PM_SYS_STATUS_OK;
          }
          format_resp->command = M2M2_PM_SYS_COMMAND_FLASH_RESET_RESP;
          /* send response packet */
          response_mail->src = pkt->dest;
          response_mail->dest = pkt->src;

          post_office_send(response_mail, &err);

          /* Power off Flash */
          fs_flash_power_on(false);
        }
        post_office_consume_msg(pkt);
        break;
      }
#endif
      case M2M2_PM_SYS_COMMAND_SYSTEM_RESET_REQ: {
        response_mail = post_office_create_msg(M2M2_HEADER_SZ + sizeof(m2m2_pm_sys_cmd_t));
        if (response_mail != NULL) {
          m2m2_pm_sys_cmd_t *set_sys_rst_resp =
              (m2m2_pm_sys_cmd_t *)&response_mail->data[0];

          /* send response packet */
          response_mail->src = pkt->dest;
          response_mail->dest = pkt->src;
          set_sys_rst_resp->command =
              (M2M2_APP_COMMON_CMD_ENUM_t)M2M2_PM_SYS_COMMAND_SYSTEM_RESET_RESP;
          set_sys_rst_resp->status =
              (M2M2_APP_COMMON_STATUS_ENUM_t)M2M2_PM_SYS_STATUS_OK;
          post_office_send(response_mail, &err);
          MCU_HAL_Delay(20);
#ifdef USE_FS
          /* if logging is in progress , close file */
          if(UpdateFileInfo() == true){
            NRF_LOG_INFO("Success file close ");
          }
          else {
            /* failure */
            NRF_LOG_INFO("Error file close");
          }
#endif
          rtc_timestamp_store(320);
          NVIC_SystemReset();
          // pm_System_reboot();

          NRF_LOG_INFO("Initiating Software reset");
        }
        post_office_consume_msg(pkt);
        break;
      }
      case M2M2_PM_SYS_COMMAND_SYSTEM_HW_RESET_REQ: {
        response_mail =
            post_office_create_msg(M2M2_HEADER_SZ + sizeof(m2m2_pm_sys_cmd_t));
        if (response_mail != NULL) {
          m2m2_pm_sys_cmd_t *set_sys_rst_resp =
              (m2m2_pm_sys_cmd_t *)&response_mail->data[0];

          /* send response packet */
          response_mail->src = pkt->dest;
          response_mail->dest = pkt->src;
          set_sys_rst_resp->command = (M2M2_APP_COMMON_CMD_ENUM_t)
              M2M2_PM_SYS_COMMAND_SYSTEM_HW_RESET_RESP;
          set_sys_rst_resp->status =
              (M2M2_APP_COMMON_STATUS_ENUM_t)M2M2_PM_SYS_STATUS_OK;
          post_office_send(response_mail, &err);
          MCU_HAL_Delay(20);
          // rtc_timestamp_store(320);//no use at here,because the reset time is
          // unfixed.
#ifdef USE_FS
          /* if logging is in progress , close file */
          if(UpdateFileInfo() == true){
            NRF_LOG_INFO("Success file close ");
          }
          else {
            /* failure */
            NRF_LOG_INFO("Error file close");
          }
#endif
          trigger_nRF_MCU_hw_reset();
          NRF_LOG_INFO("Initiating Hardware reset");
        }
        post_office_consume_msg(pkt);
        break;
      }
      case M2M2_SENSOR_COMMON_CMD_READ_REG_16_REQ:
      case M2M2_SENSOR_COMMON_CMD_WRITE_REG_16_REQ:
        response_mail = adp5360_app_reg_access(pkt);
        if (response_mail != NULL) {
          post_office_send(response_mail, &err);
        }
        post_office_consume_msg(pkt);
        break;
      case M2M2_PM_SYS_BATTERY_LEVEL_ALERT:
        post_office_consume_msg(pkt);
        break;
      case M2M2_PM_SYS_COMMAND_GET_BAT_INFO_REQ: {
        response_mail = post_office_create_msg(
            M2M2_HEADER_SZ + sizeof(m2m2_pm_sys_bat_info_resp_t));
        if (response_mail != NULL) {
          m2m2_pm_sys_bat_info_resp_t *batt_info_resp =
              (m2m2_pm_sys_bat_info_resp_t *)&response_mail->data[0];
          BATTERY_STATUS_t bat_status;
          if (Adp5360_get_battery_details(&bat_status) != ADP5360_SUCCESS) {
            batt_info_resp->status = M2M2_PM_SYS_STATUS_ERR_ARGS;
          } else {
            batt_info_resp->status = M2M2_PM_SYS_STATUS_OK;
          }
          /* send response packet */
          response_mail->src = pkt->dest;
          response_mail->dest = pkt->src;
          batt_info_resp->command =
              (M2M2_APP_COMMON_CMD_ENUM_t)M2M2_PM_SYS_COMMAND_GET_BAT_INFO_RESP;

          switch (bat_status.chrg_status) {
          case BATTERY_NOT_AVAILABLE: {
            batt_info_resp->bat_chrg_stat = M2M2_PM_SYS_BAT_STATE_NOT_AVAIL;
            break;
          }
          case BATTERY_CHARGING: {
            batt_info_resp->bat_chrg_stat = M2M2_PM_SYS_BAT_STATE_CHARGING;
            break;
          }
          case BATTERY_CHARGE_COMPLETE: {
            batt_info_resp->bat_chrg_stat = M2M2_PM_SYS_BAT_STATE_COMPLETE;
            break;
          }
          case BATTERY_NOT_CHARGING: {
            batt_info_resp->bat_chrg_stat = M2M2_PM_SYS_BAT_STATE_NOT_CHARGING;
            break;
          }
          case BATTERY_DETECTION: {
            batt_info_resp->bat_chrg_stat = M2M2_PM_SYS_BAT_STATE_DETECTION;
            break;
          }
          case BATTERY_CHARGER_LDO_MODE: {
            batt_info_resp->bat_chrg_stat =
                M2M2_PM_SYS_BAT_STATE_CHARGE_LDO_MODE;
            break;
          }
          case BATTERY_CHARGER_TIMER_EXPIRED: {
            batt_info_resp->bat_chrg_stat =
                M2M2_PM_SYS_BAT_STATE_CHARGE_TIMER_EXPIRED;
            break;
          }
          case BATTERY_UNKNOWN:
          default: {
            batt_info_resp->bat_chrg_stat = M2M2_PM_SYS_BAT_STATE_CHARGE_ERR;
            break;
          }
          }
          time_t return_time;
          int16_t timezone_offset;

          get_log_time_stamp(&return_time, &timezone_offset);
          batt_info_resp->timestamp = return_time + timezone_offset;
          batt_info_resp->bat_mv = bat_status.voltage_mv;
          // batt_info_resp->bat_temp = bat_status.temp_c;
          batt_info_resp->bat_lvl = bat_status.level;
          post_office_send(response_mail, &err);
        }
        post_office_consume_msg(pkt);
        break;
      }
#ifdef TO_BE_USED
      case M2M2_PM_SYS_COMMAND_SET_BAT_THR_REQ: {
        m2m2_pm_sys_bat_thr_req_t *bat_thr_req =
            (m2m2_pm_sys_bat_thr_req_t *)&pkt->data[0];
        response_mail = post_office_create_msg(
            M2M2_HEADER_SZ + sizeof(_m2m2_app_common_cmd_t));
        if (response_mail != NULL) {
          _m2m2_app_common_cmd_t *batt_thr_resp =
              (_m2m2_app_common_cmd_t *)&response_mail->data[0];

          /* Set battery critical and low levels */
          battery_level_alerts.level_low = bat_thr_req->bat_level_low;
          battery_level_alerts.level_critical = bat_thr_req->bat_level_critical;

          /* send response packet */
          response_mail->src = pkt->dest;
          response_mail->dest = pkt->src;
          batt_thr_resp->command =
              (M2M2_APP_COMMON_CMD_ENUM_t)M2M2_PM_SYS_COMMAND_SET_BAT_THR_RESP;
          batt_thr_resp->status =
              (M2M2_APP_COMMON_STATUS_ENUM_t)M2M2_PM_SYS_STATUS_OK;
          post_office_send(response_mail, &err);
        }
        post_office_consume_msg(pkt);
        break;
      }
#endif // TO_BE_USED
      case M2M2_PM_SYS_COMMAND_GET_INFO_REQ: {
        response_mail =
            post_office_create_msg(M2M2_HEADER_SZ + sizeof(m2m2_pm_sys_info_t));
        if (response_mail != NULL) {
          m2m2_pm_sys_info_t *system_info =
              (m2m2_pm_sys_info_t *)&response_mail->data[0];

#ifdef VSM_MBOARD
         g_system_info.board_type = ADI_PM_BOARD_TYPE_VSM_WATCH;
#else
         g_system_info.board_type = ADI_PM_BOARD_TYPE_STUDYWATCH;
#endif
          /* copy system information from global system info */
          memcpy(
              system_info, (void *)&g_system_info, sizeof(m2m2_pm_sys_info_t));

          /* send response packet */
          response_mail->src = pkt->dest;
          response_mail->dest = pkt->src;
          post_office_send(response_mail, &err);
        }
        post_office_consume_msg(pkt);
        break;
      }
      case M2M2_APP_COMMON_CMD_PING_REQ: {
        m2m2_app_common_ping_t *ctrl1 = (m2m2_app_common_ping_t *)&pkt->data[0];

