ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/system/system_task.c
        manufacture_date_t *date_req =
            (manufacture_date_t *)&pkt->data[2];
        date.year = date_req->year;
        date.month = date_req->month;
        date.day = date_req->day;
        M2M2_PM_SYS_STATUS_ENUM_t status;

        if(NRF_SUCCESS == manufacture_date_save( &date))
        {
            status = (M2M2_PM_SYS_STATUS_ENUM_t)M2M2_APP_COMMON_STATUS_OK;
        }
        else
        {
            status = (M2M2_PM_SYS_STATUS_ENUM_t)M2M2_APP_COMMON_STATUS_ERROR;
        }
#ifdef ENABLE_WATCH_DISPLAY
        send_private_type_value(DIS_REFRESH_SIGNAL);
#endif
        response_mail = post_office_create_msg(
            M2M2_HEADER_SZ + sizeof(_m2m2_app_common_cmd_t));
        if (response_mail != NULL) {
          _m2m2_app_common_cmd_t *date_time_resp =
              (_m2m2_app_common_cmd_t *)&response_mail->data[0];

          /* send response packet */
          response_mail->src = pkt->dest;
          response_mail->dest = pkt->src;
          date_time_resp->command = (M2M2_APP_COMMON_CMD_ENUM_t)
              M2M2_PM_SYS_COMMAND_SET_MANUFACTURE_DATE_RESP;
          date_time_resp->status = (M2M2_APP_COMMON_STATUS_ENUM_t)status;
          post_office_send(response_mail, &err);
        }
        post_office_consume_msg(pkt);
        break;
      }
      case M2M2_PM_SYS_COMMAND_GET_MANUFACTURE_DATE_REQ: {
        M2M2_PM_SYS_STATUS_ENUM_t status = M2M2_PM_SYS_STATUS_ERR_NOT_CHKD;
        m_time_struct *local_get_date_time;

        response_mail = post_office_create_msg(
            M2M2_HEADER_SZ + sizeof(m2m2_manufacture_date_t));
        if (response_mail != NULL) {
          m2m2_manufacture_date_t *date_resp =
              (m2m2_manufacture_date_t *)&response_mail->data[0];
          manufacture_date_t *date =
            (manufacture_date_t *)&response_mail->data[2];
          uint16_t len = sizeof(date_resp);
          if (manufacture_date_read(date) == NRF_SUCCESS)
          {
                status = (M2M2_PM_SYS_STATUS_ENUM_t)M2M2_APP_COMMON_STATUS_OK;
          }
          else
          {
                status = (M2M2_PM_SYS_STATUS_ENUM_t)M2M2_APP_COMMON_STATUS_ERROR;
          }

          /* send response packet */
          response_mail->src = pkt->dest;
          response_mail->dest = pkt->src;
          date_resp->command = (M2M2_APP_COMMON_CMD_ENUM_t)
              M2M2_PM_SYS_COMMAND_GET_MANUFACTURE_DATE_RESP;
          date_resp->status = (M2M2_APP_COMMON_STATUS_ENUM_t)status;
          post_office_send(response_mail, &err);
        }
        post_office_consume_msg(pkt);
        break;
      }
      case M2M2_PM_SYS_COMMAND_GET_MCU_VERSION_REQ: {
        response_mail = post_office_create_msg(
            M2M2_HEADER_SZ + sizeof(m2m2_pm_sys_mcu_version_t));
        if (response_mail != NULL) {
          m2m2_pm_sys_mcu_version_t *mcu_version_response =
              (m2m2_pm_sys_mcu_version_t *)&response_mail->data[0];

          /* send response packet */
          response_mail->src = pkt->dest;
          response_mail->dest = pkt->src;
          mcu_version_response->command =
              M2M2_PM_SYS_COMMAND_GET_MCU_VERSION_RESP;
          mcu_version_response->status =
              M2M2_PM_SYS_STATUS_OK;
          mcu_version_response->mcu = M2M2_PM_SYS_MCU_M4;
          post_office_send(response_mail, &err);
        }
        post_office_consume_msg(pkt);
        break;
      }
      case M2M2_PM_GET_APPS_HEALTH_REQ: {
        response_mail = post_office_create_msg(
            M2M2_HEADER_SZ + sizeof(m2m2_get_apps_running_stat_resp_cmd_t));
        if (response_mail != NULL) {
          m2m2_get_apps_running_stat_resp_cmd_t
              *apps_health_stat_info_response =
                  (m2m2_get_apps_running_stat_resp_cmd_t *)&response_mail
                      ->data[0];
          /* send response packet */
          response_mail->src = pkt->dest;
          response_mail->dest = pkt->src;
          apps_health_stat_info_response->command =
              M2M2_PM_GET_APPS_HEALTH_RESP;
          apps_health_stat_info_response->status =
              (M2M2_PM_SYS_STATUS_ENUM_t)M2M2_APP_COMMON_STATUS_OK;
          apps_health_stat_info_response->ad5940_isr_cnt =
              Ad5940DrvGetDebugInfo();
          apps_health_stat_info_response->adpd4000_isr_cnt =
              Adpd400xDrvGetISRDebugInfo();
          apps_health_stat_info_response->adxl_isr_cnt = AdxlDrvGetDebugInfo();
          post_office_send(response_mail, &err);
        }
        post_office_consume_msg(pkt);
        break;
      }
      case M2M2_PM_SYS_COMMAND_DG2502_SW_CNTRL_REQ: {
        response_mail = post_office_create_msg(
            M2M2_HEADER_SZ + sizeof(m2m2_pm_sys_dg2502_sw_ctrl_cmd_t));
        if (response_mail != NULL) {
          m2m2_pm_sys_dg2502_sw_ctrl_cmd_t *dg2502_sw_cntrl_resp =
              (m2m2_pm_sys_dg2502_sw_ctrl_cmd_t *)&response_mail->data[0];
          m2m2_pm_sys_dg2502_sw_ctrl_cmd_t *req1 =
              (m2m2_pm_sys_dg2502_sw_ctrl_cmd_t *)&pkt->data[0];

          switch (req1->sw_name) {
#ifdef ENABLE_ECG_APP
          case M2M2_PM_SYS_DG2502_8233_SW:
            /*We are not alterning anything when apps are running*/
            if( 1
                #ifdef  ENABLE_EDA_APP
                && (gEdaAppInitFlag == false)
                #endif
                #ifdef  ENABLE_ECG_APP
                && (gEcgAppInitFlag == false)
                #endif
                #ifdef  ENABLE_BCM_APP
                && (gBiaAppInitFlag == false)
                #endif
                ) {
              /*Turning LDO always on so that even duplicate disable commands work fine*/
              adp5360_enable_ldo(ECG_LDO, true);
              DG2502_SW_control_AD8233(req1->sw_enable);
              dg2502_sw_cntrl_resp->status = M2M2_PM_SYS_STATUS_OK;
              /* While disabling the switch, EPHYZ LDO needs to be turned OFF
               via M2M2_PM_SYS_COMMAND_LDO_CNTRL_REQ m2m2 cmd */
            }
            else {
              /*TODO a better enum can be created to explain this error*/
              dg2502_sw_cntrl_resp->status = M2M2_PM_SYS_STATUS_ERR_ARGS;
            }
            break;
#endif
          case M2M2_PM_SYS_DG2502_5940_SW:
            /*We are not alterning anything when apps are running*/
            /* TODO defined flags need to be checked */
            if( 1
                #ifdef  ENABLE_EDA_APP
                && (gEdaAppInitFlag == false)
                #endif
                #ifdef  ENABLE_ECG_APP
                && (gEcgAppInitFlag == false)
                #endif
                #ifdef  ENABLE_BCM_APP
                && (gBiaAppInitFlag == false)
                #endif
                ) {
              /*Turning LDO always on so that even duplicate disable commands work fine*/
              adp5360_enable_ldo(ECG_LDO, true);
              DG2502_SW_control_AD5940(req1->sw_enable);
              dg2502_sw_cntrl_resp->status = M2M2_PM_SYS_STATUS_OK;
              /* While disabling the switch, EPHYZ LDO needs to be turned OFF
                via M2M2_PM_SYS_COMMAND_LDO_CNTRL_REQ m2m2 cmd */
            }
            else {
              /*TODO a better enum can be created to explain this error*/
              dg2502_sw_cntrl_resp->status = M2M2_PM_SYS_STATUS_ERR_ARGS;
            }
            break;
          case M2M2_PM_SYS_DG2502_4K_SW:
            if(req1->sw_enable == 0x01)
            {
              /* Turn ON EPHYZ LDO before enabling electrode switch for ADPDD4K */
              adp5360_enable_ldo(ECG_LDO, true);
            }
            DG2502_SW_control_ADPD4000(req1->sw_enable);
            /* While disabling the switch, EPHYZ LDO needs to be turned OFF
               via M2M2_PM_SYS_COMMAND_LDO_CNTRL_REQ m2m2 cmd */
            dg2502_sw_cntrl_resp->status = M2M2_PM_SYS_STATUS_OK;
            break;
          default:
            dg2502_sw_cntrl_resp->status = M2M2_PM_SYS_STATUS_ERR_ARGS;
            break;
          }

          /* send response packet */
          response_mail->src = pkt->dest;
          response_mail->dest = pkt->src;
          dg2502_sw_cntrl_resp->command =
              M2M2_PM_SYS_COMMAND_DG2502_SW_CNTRL_RESP;
          dg2502_sw_cntrl_resp->sw_name = req1->sw_name;
          dg2502_sw_cntrl_resp->sw_enable = req1->sw_enable;
          post_office_send(response_mail, &err);
        }
        post_office_consume_msg(pkt);
        break;
      }
      case M2M2_PM_SYS_COMMAND_LDO_CNTRL_REQ: {
        response_mail = post_office_create_msg(
            M2M2_HEADER_SZ + sizeof(m2m2_pm_sys_ldo_ctrl_cmd_t));
        if (response_mail != NULL) {
          m2m2_pm_sys_ldo_ctrl_cmd_t *ldo_cntrl_resp =
              (m2m2_pm_sys_ldo_ctrl_cmd_t *)&response_mail->data[0];
          m2m2_pm_sys_ldo_ctrl_cmd_t *req1 =
              (m2m2_pm_sys_ldo_ctrl_cmd_t *)&pkt->data[0];

          switch (req1->ldo_num) {
          case FS_LDO:
          case OPT_DEV_LDO:
          case ECG_LDO:
            adp5360_enable_ldo(
                req1->ldo_num, (req1->ldo_enable == 0) ? false : true);
            ldo_cntrl_resp->status = M2M2_PM_SYS_STATUS_OK;
            break;
          default:
            ldo_cntrl_resp->status = M2M2_PM_SYS_STATUS_ERR_ARGS;
            break;
          }

          /* send response packet */
          response_mail->src = pkt->dest;
          response_mail->dest = pkt->src;
          ldo_cntrl_resp->command = M2M2_PM_SYS_COMMAND_LDO_CNTRL_RESP;
          ldo_cntrl_resp->ldo_num = req1->ldo_num;
          ldo_cntrl_resp->ldo_enable = req1->ldo_enable;
          post_office_send(response_mail, &err);
        }
        post_office_consume_msg(pkt);
        break;
      }
      case M2M2_PM_SYS_COMMAND_CHIP_ID_REQ: {
        response_mail = post_office_create_msg(
            M2M2_HEADER_SZ + sizeof(m2m2_pm_sys_chip_id_cmd_t));
        if (response_mail != NULL) {
          uint8_t devID;
          uint8_t manufacture_id;
          m2m2_pm_sys_chip_id_cmd_t *chip_id_resp =
              (m2m2_pm_sys_chip_id_cmd_t *)&response_mail->data[0];
          m2m2_pm_sys_chip_id_cmd_t *req1 =
              (m2m2_pm_sys_chip_id_cmd_t *)&pkt->data[0];

