ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/system/system_task.c
          switch (req1->chip_name) {
          case M2M2_PM_SYS_ADXL362:
            // Get Part ID of ADXL362
            chip_id_resp->chip_id = GetPartIdAdxl362();
            chip_id_resp->status = M2M2_PM_SYS_STATUS_OK;
            break;
          case M2M2_PM_SYS_ADPD4K:
            // Get Chip ID of ADPD4000
            chip_id_resp->chip_id = GetChipIdAdpd();
            chip_id_resp->status = M2M2_PM_SYS_STATUS_OK;
            break;
          case M2M2_PM_SYS_ADP5360:
            // Get Device ID of ADP5360
            Adp5360_getDevID(&devID);
            chip_id_resp->chip_id = devID;
            chip_id_resp->status = M2M2_PM_SYS_STATUS_OK;
            break;
          case M2M2_PM_SYS_AD5940:
            // Get chip id of AD5940
            adp5360_enable_ldo(ECG_LDO, true); // power on LDO
            chip_id_resp->chip_id = AD5940_GetChipID();
            ad5940_port_deInit();
            adp5360_enable_ldo(ECG_LDO, false); // power off LDO
            chip_id_resp->status = M2M2_PM_SYS_STATUS_OK;
            break;
#ifdef USE_FS
          case M2M2_PM_SYS_NAND_FLASH:
            // Get Device id of NAND Flash
            nand_flash_read_id(&manufacture_id, &devID);
            chip_id_resp->chip_id = devID;
            chip_id_resp->status = M2M2_PM_SYS_STATUS_OK;
            break;
#endif
          case M2M2_PM_SYS_AD7156:
            // Get chip ID of AD7156
            devID = getAD7156ChipID();
            chip_id_resp->chip_id = devID;
            chip_id_resp->status = M2M2_PM_SYS_STATUS_OK;
            break;
          default:
            chip_id_resp->status = M2M2_PM_SYS_STATUS_ERR_ARGS;
            break;
          }

          /* send response packet */
          response_mail->src = pkt->dest;
          response_mail->dest = pkt->src;
          chip_id_resp->command = M2M2_PM_SYS_COMMAND_CHIP_ID_RESP;
          chip_id_resp->chip_name = req1->chip_name;
          post_office_send(response_mail, &err);
        }
        post_office_consume_msg(pkt);
        break;
      }
      case M2M2_PM_SYS_COMMAND_CAP_SENSE_TEST_REQ: {
        touch_test_func(pkt);
        break;
      }
      case M2M2_PM_SYS_COMMAND_ENTER_BOOTLOADER_REQ: {
        response_mail = post_office_create_msg(
            M2M2_HEADER_SZ + sizeof(m2m2_pm_sys_enter_bloader_cmd_t));
        if (response_mail != NULL) {
          m2m2_pm_sys_enter_bloader_cmd_t *resp =
              (m2m2_pm_sys_enter_bloader_cmd_t *)&response_mail->data[0];

          /* send response packet */
          response_mail->src = pkt->dest;
          response_mail->dest = pkt->src;
          resp->command = M2M2_PM_SYS_COMMAND_ENTER_BOOTLOADER_RESP;

          if (NRF_SUCCESS != enter_bootloader_and_restart()) {
            resp->status = M2M2_PM_SYS_STATUS_ERR_ARGS;
          } else {
            resp->status = M2M2_PM_SYS_STATUS_OK; // in fact, can't go here.
          }

          post_office_send(response_mail, &err);
        }
        post_office_consume_msg(pkt);
        break;
      }

      case M2M2_APP_COMMON_CMD_SENSOR_STATUS_QUERY_RESP: {
        m2m2_hdr_t *resp_pkt = NULL;
        ADI_OSAL_STATUS err;

        resp_pkt = post_office_create_msg(
            M2M2_HEADER_SZ + sizeof(m2m2_app_common_sub_op_t));
        if (resp_pkt != NULL) {

          m2m2_app_common_sub_op_t *resp =
              (m2m2_app_common_sub_op_t *)&(resp_pkt->data[0]);
          m2m2_app_common_status_t *in_resp =
              (m2m2_app_common_status_t *)&(pkt->data[0]);
          m2m2_pm_sys_sensor_app_status *sensor_info_resp =
              (m2m2_pm_sys_sensor_app_status *)&(
                  gsSensorAppsInfoPayload->app_info[gsActivePsAppCnt]);

          sensor_info_resp->sensor_app_id = pkt->src;
          sensor_info_resp->num_subscribers = in_resp->num_subscribers;
          sensor_info_resp->num_start_reqs = in_resp->num_start_reqs;
          sensor_info_resp->sensor_stream = in_resp->stream;

#ifdef USE_FS
          resp_pkt->dest = M2M2_ADDR_SYS_FS;
          resp_pkt->src = M2M2_ADDR_SYS_PM; // gsSensorAppsInfoPkt
          resp->stream = in_resp->stream;//get_file_routing_table_entry_stream(pkt->src);
          resp->command = M2M2_FILE_SYS_CMD_GET_FS_STREAM_SUB_STATUS_REQ;
#else
          resp_pkt->dest = M2M2_ADDR_SYS_PM;
          resp_pkt->src = M2M2_ADDR_SYS_PM; // gsSensorAppsInfoPkt
          resp->command = M2M2_PM_SYS_COMMAND_GET_APPS_INFO_REQ;
          gsPsAppNumber++;
          gsActivePsAppCnt++;
#endif
          post_office_send(resp_pkt, &err);
        }
        post_office_consume_msg(pkt);
        break;
      }
      case M2M2_FILE_SYS_CMD_GET_FS_STREAM_SUB_STATUS_RESP: {
        m2m2_hdr_t *resp_pkt = NULL;
        ADI_OSAL_STATUS err;

        resp_pkt = post_office_create_msg(
            M2M2_HEADER_SZ + sizeof(_m2m2_app_common_cmd_t));
        if (resp_pkt != NULL) {

          m2m2_app_common_status_t *resp =
              (m2m2_app_common_status_t *)&(resp_pkt->data[0]);
          m2m2_file_sys_get_subs_status_resp_t *in_resp =
              (m2m2_file_sys_get_subs_status_resp_t *)&(pkt->data[0]);
          m2m2_pm_sys_sensor_app_status *sensor_info_resp =
              (m2m2_pm_sys_sensor_app_status *)&(
                  gsSensorAppsInfoPayload->app_info[gsActivePsAppCnt]);

          sensor_info_resp->fs_sub_stat = in_resp->subs_state;

          //            gsSensorAppsInfoPayload->num_sensor_apps =
          //            gsPsAppNumber;
          resp_pkt->dest = M2M2_ADDR_SYS_PM;
          resp_pkt->src = M2M2_ADDR_SYS_PM; // gsSensorAppsInfoPkt
          resp->command = M2M2_PM_SYS_COMMAND_GET_APPS_INFO_REQ;
          /* Handle next sensor App once M2M2_ADDR_SENSOR_ADPD4000 is completed */
          if( !gnAdpdSensorApp )
            gsPsAppNumber++;
          gsActivePsAppCnt++;
          post_office_send(resp_pkt, &err);
        }
        post_office_consume_msg(pkt);
        break;
      }
      case M2M2_PM_SYS_BLE_GET_MAX_TX_PKT_COMB_CNT_REQ: {
        response_mail = post_office_create_msg(
            M2M2_HEADER_SZ + sizeof(m2m2_ble_max_tx_pkt_comb_cnt_resp_cmd_t));
        if (response_mail != NULL) {
          m2m2_ble_max_tx_pkt_comb_cnt_resp_cmd_t *ble_max_tx_pkt_comb_cnt_resp =
              (m2m2_ble_max_tx_pkt_comb_cnt_resp_cmd_t *)&response_mail->data[0];

          /* send response packet */
          response_mail->src = pkt->dest;
          response_mail->dest = pkt->src;
          ble_max_tx_pkt_comb_cnt_resp->command =
              M2M2_PM_SYS_BLE_GET_MAX_TX_PKT_COMB_CNT_RESP;
          ble_max_tx_pkt_comb_cnt_resp->status =
              M2M2_PM_SYS_STATUS_OK;
          ble_max_tx_pkt_comb_cnt_resp->max_tx_pkt_comb_cnt = get_max_tx_pkt_comb_cnt();
          post_office_send(response_mail, &err);
        }
        post_office_consume_msg(pkt);
        break;
      }
      case M2M2_PM_SYS_BLE_SET_MAX_TX_PKT_COMB_CNT_REQ: {
        m2m2_ble_max_tx_pkt_comb_cnt_resp_cmd_t *ble_max_tx_pkt_comb_cnt_req =
              (m2m2_ble_max_tx_pkt_comb_cnt_resp_cmd_t *)&pkt->data[0];
        response_mail = post_office_create_msg(
            M2M2_HEADER_SZ + sizeof(m2m2_ble_max_tx_pkt_comb_cnt_resp_cmd_t));
        if (response_mail != NULL) {
          uint8_t ret_val;
          m2m2_ble_max_tx_pkt_comb_cnt_resp_cmd_t *ble_max_tx_pkt_comb_cnt_resp =
              (m2m2_ble_max_tx_pkt_comb_cnt_resp_cmd_t *)&response_mail->data[0];

          ret_val = set_max_tx_pkt_comb_cnt(ble_max_tx_pkt_comb_cnt_req->max_tx_pkt_comb_cnt);
          /* send response packet */
          response_mail->src = pkt->dest;
          response_mail->dest = pkt->src;
          ble_max_tx_pkt_comb_cnt_resp->command =
              M2M2_PM_SYS_BLE_SET_MAX_TX_PKT_COMB_CNT_RESP;
          ble_max_tx_pkt_comb_cnt_resp->status = (ret_val == 0)?
              M2M2_PM_SYS_STATUS_OK : M2M2_PM_SYS_STATUS_ERR_ARGS;
          ble_max_tx_pkt_comb_cnt_resp->max_tx_pkt_comb_cnt =
                                    ble_max_tx_pkt_comb_cnt_req->max_tx_pkt_comb_cnt;
          post_office_send(response_mail, &err);
        }
        post_office_consume_msg(pkt);
        break;
      }
#ifdef HIBERNATE_MD_EN
      case M2M2_PM_SYS_GET_HIBERNATE_MODE_STATUS_REQ: {
        response_mail = post_office_create_msg(
            M2M2_HEADER_SZ + sizeof(m2m2_hibernate_mode_status_resp_cmd_t));
        if (response_mail != NULL) {
          m2m2_hibernate_mode_status_resp_cmd_t *hib_mode_status_resp =
              (m2m2_hibernate_mode_status_resp_cmd_t *)&response_mail->data[0];

          /* send response packet */
          response_mail->src = pkt->dest;
          response_mail->dest = pkt->src;
          hib_mode_status_resp->command =
              M2M2_PM_SYS_GET_HIBERNATE_MODE_STATUS_RESP;
          hib_mode_status_resp->status =
              M2M2_PM_SYS_STATUS_OK;
          hib_mode_status_resp->hib_mode_status = get_hib_mode_control();
          post_office_send(response_mail, &err);
        }
        post_office_consume_msg(pkt);
        break;
      }
      case M2M2_PM_SYS_SET_HIBERNATE_MODE_STATUS_REQ: {
        m2m2_hibernate_mode_status_resp_cmd_t *hib_mode_status_req =
              (m2m2_hibernate_mode_status_resp_cmd_t *)&pkt->data[0];
        response_mail = post_office_create_msg(
            M2M2_HEADER_SZ + sizeof(m2m2_hibernate_mode_status_resp_cmd_t));
        if (response_mail != NULL) {
          uint8_t ret_val;
          m2m2_hibernate_mode_status_resp_cmd_t *hib_mode_status_resp =
              (m2m2_hibernate_mode_status_resp_cmd_t *)&response_mail->data[0];

          ret_val = set_hib_mode_control(hib_mode_status_req->hib_mode_status);
          /* send response packet */
          response_mail->src = pkt->dest;
          response_mail->dest = pkt->src;
          hib_mode_status_resp->command =
              M2M2_PM_SYS_SET_HIBERNATE_MODE_STATUS_RESP;
          hib_mode_status_resp->status = (ret_val == 0)?
              M2M2_PM_SYS_STATUS_OK : M2M2_PM_SYS_STATUS_ERR_ARGS;
          hib_mode_status_resp->hib_mode_status =
                                    hib_mode_status_req->hib_mode_status;
          post_office_send(response_mail, &err);
        }
        post_office_consume_msg(pkt);
        break;
      }
#endif
#ifdef LOW_TOUCH_FEATURE
      case M2M2_PM_SYS_COMMAND_ENABLE_USER_CONFIG_LOG_REQ: {
        //            gsPsReadyFlag = 1;
        if (usb_pkt_src != M2M2_ADDR_UNDEFINED) {
          low_touch_info.tool_addr = usb_pkt_src;
        }
        else if (ble_pkt_src != M2M2_ADDR_UNDEFINED) {
          low_touch_info.tool_addr = ble_pkt_src;
        }
        /*if (pkt->src != M2M2_ADDR_UNDEFINED) {
            low_touch_info.tool_addr = pkt->src;
          }*/
        low_touch_info.cmd = ctrl_cmd->command;
        if (!gLowTouchRunning) {
          GetVolInfo();
        } else {
          SendLowTouchErrResp(
              M2M2_PM_SYS_STATUS_LOW_TOUCH_LOGGING_ALREADY_STARTED);
          SendSystemAlarmNtfMsg(M2M2_APP_COMMON_ALARM_STATUS_LOW_TOUCH_LOGGING_ALREADY_STARTED);
        }
        post_office_consume_msg(pkt);
        break;
      }
      case M2M2_FILE_SYS_CMD_VOL_INFO_RESP: {
        m2m2_file_sys_vol_info_resp_t *fs_free_space_resp =
            (m2m2_file_sys_vol_info_resp_t *)&pkt->data[0];
        if (fs_free_space_resp->status == M2M2_FILE_SYS_STATUS_OK) {
          if (fs_free_space_resp->usedmemory < MAX_USABLE_MEMORY_SIZE) {
            gSendRespToPmApp = 1;
            GetFileCount();
          } else {
            SendLowTouchErrResp(M2M2_PM_SYS_STATUS_LOW_TOUCH_MEMORY_FULL_ERR);
            SendSystemAlarmNtfMsg(M2M2_APP_COMMON_ALARM_STATUS_LOW_TOUCH_MEMORY_FULL_ERR);
            MaxFileErr(); /*Memory is full ; give indication on Display*/
          }
        } else {
          LowTouchErr(); /* Error while getting the fs vol info, give indication on Display*/
        }
        post_office_consume_msg(pkt);
        break;
      }
      case M2M2_FILE_SYS_CMD_GET_NUMBER_OF_FILE_RESP: {
        m2m2_file_sys_get_file_count_pkt_t *get_num_files_resp =
            (m2m2_file_sys_get_file_count_pkt_t *)&pkt->data[0];
        if (get_num_files_resp->status != M2M2_APP_COMMON_STATUS_ERROR) {
          if (get_num_files_resp->file_count < MAX_FILE_COUNT) {
            uint8_t *gsConfigTmpFile_ptr = (uint8_t *)&gsConfigTmpFile[0];
#ifdef DCB
            // Load from gen Blk DCB
            find_low_touch_DCB();
            if (gbDCBCfgFoundFlag) {
              GEN_BLK_DCB_STATUS_t ret_val;
              gsCfgWrIndex = 0;
              SetCfgCopyAvailableFlag(
                  false); /*update the config file copy availability flag-since
                             new DCB is going to be loaded*/
              ret_val = copy_lt_config_from_gen_blk_dcb(
                  &gsConfigTmpFile_ptr[gsCfgWrIndex], &gsCfgWrIndex);
              if(GEN_BLK_DCB_STATUS_ERR == ret_val)
              {
                SendLowTouchErrResp(M2M2_PM_SYS_STATUS_CONFIG_FILE_NOT_FOUND);
                SendSystemAlarmNtfMsg(M2M2_APP_COMMON_ALARM_STATUS_CONFIG_FILE_NOT_FOUND);
                LowTouchErr(); // config file read failed
              }
              else
              {
                gsConfigFileSize = gsCfgWrIndex - CONFIG_FILE_SUMMARY_PKT_SIZE;
                InitConfigParam(1); // Enable sending start commands
                SendUserConfigCommands();
              }
            } else {
#endif
              SendFindConfigFileReq();
#ifdef DCB
            }
#endif
          } else {
            SendLowTouchErrResp(M2M2_PM_SYS_STATUS_LOW_TOUCH_MAX_FILE_ERR);
            SendSystemAlarmNtfMsg(M2M2_APP_COMMON_ALARM_STATUS_LOW_TOUCH_MAX_FILE_ERR);
            MaxFileErr(); /*Maximum File count reached; give indication on Display*/
          }
        } else {
          LowTouchErr(); /* Error while getting the num of files, give indication on Display*/
        }

        post_office_consume_msg(pkt);
        break;
      }
      case M2M2_PM_SYS_COMMAND_DISABLE_USER_CONFIG_LOG_REQ: {
        if (gLowTouchRunning) {
          if (usb_pkt_src != M2M2_ADDR_UNDEFINED) {
            low_touch_info.tool_addr = usb_pkt_src;
          }
          else if (ble_pkt_src != M2M2_ADDR_UNDEFINED) {
            low_touch_info.tool_addr = ble_pkt_src;
          }
          /*if (pkt->src != M2M2_ADDR_UNDEFINED) {
            low_touch_info.tool_addr = pkt->src;
          }*/
          low_touch_info.cmd = ctrl_cmd->command;
          gSendRespToPmApp = 1;
#ifdef LOW_TOUCH_FORCE_STOP_LOG
          SendForceStopLogging();
#else
          InitConfigParam(0);
          SendUserConfigCommands();
          // GetSensorAppsStatus();
#endif // LOW_TOUCH_FORCE_STOP_LOG
        }
        post_office_consume_msg(pkt);
        break;
      }
      case M2M2_FILE_SYS_CMD_FORCE_STOP_LOG_RESP: {
        // SendLowTouchErrResp(M2M2_PM_SYS_STATUS_USER_CONFIG_LOG_DISABLED);
        if (ctrl_cmd->status == M2M2_FILE_SYS_ERR_MEMORY_FULL) {
          /*Force log stop response came because of memory full event*/
          SendLowTouchErrResp(M2M2_PM_SYS_STATUS_LOW_TOUCH_MEMORY_FULL_ERR);
          SendSystemAlarmNtfMsg(M2M2_APP_COMMON_ALARM_STATUS_LOW_TOUCH_MEMORY_FULL_ERR);
          /*low touch log stopped due to mem-full; stop the sensors and inform
           * the tool*/
          LowTouchErr(); // provide indication on Display
        } else {
          if (battery_level_alerts.critical_level_flag) {
            battery_level_alerts.critical_level_flag = 0;
            /*Force log stop respose came because of battery critical event*/
            SendBatteryCriticalErrResp();
          }
        }

