ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/system/system_task.c
        /*Force log stop respose came as part of low touch log stop cmd */
        GetSensorAppsStatus();
        post_office_consume_msg(pkt);
        break;
      }
#endif
      case M2M2_PM_SYS_COMMAND_GET_APPS_INFO_REQ: {
        M2M2_ADDR_ENUM_t nSensorAppAddr;
        /*As M2M2_PM_SYS_COMMAND_GET_APPS_INFO_REQ keeps getting called in a sequence
         to go over the apps, variable 'i' is used to go over the ADPD slots within the ADPD
         application, hence made static, to continue using it from the previous value.*/
        static uint8_t slot_index=0;
        m2m2_hdr_t *resp_pkt = NULL;
        ADI_OSAL_STATUS err;

        resp_pkt = post_office_create_msg(
            M2M2_HEADER_SZ + sizeof(_m2m2_app_common_cmd_t));
        if (resp_pkt != NULL) {

          while (gsPsAppNumber <
                 (gsRoutingTableSize)) // 20 -> max num of sensor apps in PM
          {
            if (!gsPsAppNumber) {
              get_routing_table_size(&gsRoutingTableSize);
              gsPsAppNumber = get_routing_table_index(
                  M2M2_ADDR_SYS_PM); // update PM task index
              gsPsAppNumber += 1;    // exclude PM application
              gsActivePsAppCnt = 0;
              gsStausCmdSrcAddr = pkt->src; // source address of the command
            }

            nSensorAppAddr = get_routing_table_element(gsPsAppNumber);
            if (nSensorAppAddr) {
              m2m2_app_common_status_t *resp =
                  (m2m2_app_common_status_t *)&(resp_pkt->data[0]);
              resp_pkt->dest = nSensorAppAddr;
              resp_pkt->checksum = 0x0000;
              resp_pkt->src = M2M2_ADDR_SYS_PM;
              resp->command = M2M2_APP_COMMON_CMD_SENSOR_STATUS_QUERY_REQ;
              if( nSensorAppAddr == M2M2_ADDR_SENSOR_ADPD4000 )
              {
                gnAdpdSensorApp = 1; //!< Set the flag to indicate that ADPD4000 Slots are being queried for status
                resp->stream =
                        (M2M2_ADDR_ENUM_t)(slot_index++ + M2M2_ADDR_SENSOR_ADPD_STREAM1);
                if( slot_index == (ADPD4K_SLOT_L-1) )
                {
                  slot_index=(ADPD4K_SLOT_A-1); //!< reset after going through 12 slots
                  gnAdpdSensorApp = 0; //!< Clear the flag to indicate ADPD4000 Slots queried for status is completed
                }
              }
              post_office_send(resp_pkt, &err);
              break;
            } else {
              gsPsAppNumber++; // Move onto next app in the routing table
            }
          }
          if (gsPsAppNumber >=
              (gsRoutingTableSize)) // 20 -> max num of sensor apps in PM
          {
            m2m2_hdr_t *sensorAppsInfoHdr = NULL;
            gsSensorAppsInfoHdr->src = M2M2_ADDR_SYS_PM;
            gsSensorAppsInfoHdr->dest = gsStausCmdSrcAddr;
            gsSensorAppsInfoHdr->length = sizeof(gsSensorAppsInfoPkt);
            gsSensorAppsInfoHdr->checksum = 0x0000;
            gsSensorAppsInfoPayload->command =
                M2M2_PM_SYS_COMMAND_GET_APPS_INFO_RESP;
            gsSensorAppsInfoPayload->status = M2M2_APP_COMMON_STATUS_OK;
            gsSensorAppsInfoPayload->num_sensor_apps = gsActivePsAppCnt;
            gsPsAppNumber = 0;
            gsActivePsAppCnt = 0;

            sensorAppsInfoHdr = post_office_create_msg(
                M2M2_HEADER_SZ + sizeof(m2m2_pm_sys_sensor_apps_info_req_t));
            if(sensorAppsInfoHdr != NULL) {
                memcpy(sensorAppsInfoHdr, gsSensorAppsInfoHdr,
                gsSensorAppsInfoHdr->length);
                post_office_send(sensorAppsInfoHdr, &err);
            }
            post_office_consume_msg(resp_pkt);

#if 0
                gLowTouchRunning = 0;
                memcpy(gsSensorStatusRespPkt,&sensorAppsInfoHdr->data[0],sizeof(m2m2_pm_sys_sensor_apps_info_req_t)); /*copy the sensor status resp pkt payload*/
                SendSensorStopCmds();       /*start sending the sensor stop commands*/
                post_office_consume(sensorAppsInfoHdr);
#endif
          }
        }
        post_office_consume_msg(pkt);
        break;
      }
      case M2M2_PM_SYS_COMMAND_GET_APPS_INFO_RESP: {
#ifdef LOW_TOUCH_FEATURE
        if (!gb_stop_streaming_if_no_logging)
          gLowTouchRunning = 0;
#endif
        memcpy(gsSensorStatusRespPkt, &pkt->data[0],
            sizeof(
                m2m2_pm_sys_sensor_apps_info_req_t)); /*copy the sensor status
                                                         resp pkt payload*/
        gsSensorStopCnt = 0, gsSensorSubCnt = 0, gsSensorAppsCnt = 0;
        SendSensorStopCmds(); /*start sending the sensor stop commands*/
        post_office_consume_msg(pkt);
        break;
      }
#ifdef LOW_TOUCH_FEATURE
      case M2M2_FILE_SYS_CMD_FIND_CONFIG_FILE_RESP: {
        m2m2_file_sys_cmd_t *find_cfg_file_resp =
            (m2m2_file_sys_cmd_t *)&pkt->data[0];
        if (find_cfg_file_resp->status == M2M2_FILE_SYS_CONFIG_FILE_FOUND) {
          if (IsCfgCopyAvailable()) {
            InitConfigParam(1); // Enable sending start commands
            SendUserConfigCommands();
          } else {
            gsCfgWrIndex = 0;
            ReadConfigFile();
          }
        } else {
          SendLowTouchErrResp(M2M2_PM_SYS_STATUS_CONFIG_FILE_NOT_FOUND);
          SendSystemAlarmNtfMsg(M2M2_APP_COMMON_ALARM_STATUS_CONFIG_FILE_NOT_FOUND);
          LowTouchErr(); // config file doesn't exist
        }
        post_office_consume_msg(pkt);
        break;
      }
      case M2M2_FILE_SYS_CMD_DOWNLOAD_LOG_RESP: {
        m2m2_file_sys_download_log_stream_t *resp = (m2m2_file_sys_download_log_stream_t *)&pkt->data[0];
        if (resp->status == M2M2_FILE_SYS_STATUS_OK ||
            resp->status == M2M2_FILE_SYS_END_OF_FILE) {
          uint8_t *gsConfigTmpFile_ptr = (uint8_t *)&gsConfigTmpFile[0];
          memcpy(&gsConfigTmpFile_ptr[gsCfgWrIndex], &resp->page_chunk_bytes[0],resp->page_chunk_size);
          gsCfgWrIndex += resp->page_chunk_size;
          if (resp->status == M2M2_FILE_SYS_END_OF_FILE) {
            gsConfigFileSize = gsCfgWrIndex - CONFIG_FILE_SUMMARY_PKT_SIZE;
            //                    gsConfigFileFromFlash =1;
            InitConfigParam(1); // Enable sending start commands
            SendUserConfigCommands();
          }
        } else {
          SendLowTouchErrResp(M2M2_PM_SYS_STATUS_CONFIG_FILE_READ_ERR);
          SendSystemAlarmNtfMsg(M2M2_APP_COMMON_ALARM_STATUS_CONFIG_FILE_READ_ERR);
          LowTouchErr(); // Reading config file failed
        }
        post_office_consume_msg(pkt);
        break;
      }
      case M2M2_PS_SYS_COMMAND_GET_LOW_TOUCH_LOGGING_STATUS_REQ: {
        response_mail =
            post_office_create_msg(M2M2_HEADER_SZ + sizeof(m2m2_pm_sys_cmd_t));
        if (response_mail != NULL) {
          m2m2_pm_sys_cmd_t *low_touch_resp =
              (m2m2_pm_sys_cmd_t *)&response_mail->data[0];

          /* send response packet */
          response_mail->src = pkt->dest;
          response_mail->dest = pkt->src;
          response_mail->checksum = 0x0000;
          low_touch_resp->command =
              M2M2_PS_SYS_COMMAND_GET_LOW_TOUCH_LOGGING_STATUS_RESP;

