ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/system/system_task.c
          if (gLowTouchRunning)
            low_touch_resp->status =
                M2M2_PM_SYS_STATUS_LOW_TOUCH_LOGGING_IN_PROGRESS;
          else
            low_touch_resp->status =
                M2M2_PM_SYS_STATUS_LOW_TOUCH_LOGGING_NOT_STARTED;

          post_office_send(response_mail, &err);
        }
        post_office_consume_msg(pkt);
        break;
      }
      case M2M2_PM_SYS_COMMAND_ACTIVATE_TOUCH_SENSOR_REQ: {

        uint8_t ret_val;
        if (gen_blk_get_dcb_present_flag() || gsCfgFileFoundFlag)
        {
          ret_val =
              EnableLowTouchDetection(true); // enable  the low touch detection mechanism
        }
        else
        {
          //No LT config file
          ret_val = 1;//Error
        }
        response_mail =
            post_office_create_msg(M2M2_HEADER_SZ + sizeof(m2m2_pm_sys_cmd_t));
        if (response_mail != NULL) {
          m2m2_pm_sys_cmd_t *resp =
              (m2m2_pm_sys_cmd_t *)&response_mail->data[0];

          /*Send the response*/
          response_mail->dest = pkt->src;
          response_mail->src = pkt->dest;

          resp->command = (M2M2_APP_COMMON_CMD_ENUM_t)
              M2M2_PM_SYS_COMMAND_ACTIVATE_TOUCH_SENSOR_RESP;
          resp->status =
              (ret_val == 0)
                  ? (M2M2_APP_COMMON_STATUS_ENUM_t)M2M2_PM_SYS_STATUS_OK
                  : (M2M2_APP_COMMON_STATUS_ENUM_t)M2M2_PM_SYS_STATUS_ERR_ARGS;
          post_office_send(response_mail, &err);
        }
        post_office_consume_msg(pkt);
        break;
      }

      case M2M2_PM_SYS_COMMAND_DEACTIVATE_TOUCH_SENSOR_REQ: {

        uint8_t ret_val;
        ret_val = EnableLowTouchDetection(false); // disable  the low touch detection
                                           // mechanism
        response_mail =
            post_office_create_msg(M2M2_HEADER_SZ + sizeof(m2m2_pm_sys_cmd_t));
        if (response_mail != NULL) {
          m2m2_pm_sys_cmd_t *resp =
              (m2m2_pm_sys_cmd_t *)&response_mail->data[0];

          /*Send the response*/
          response_mail->dest = pkt->src;
          response_mail->src = pkt->dest;
          resp->command = (M2M2_APP_COMMON_CMD_ENUM_t)
              M2M2_PM_SYS_COMMAND_DEACTIVATE_TOUCH_SENSOR_RESP;
          resp->status =
              (ret_val == 0)
                  ? (M2M2_APP_COMMON_STATUS_ENUM_t)M2M2_PM_SYS_STATUS_OK
                  : (M2M2_APP_COMMON_STATUS_ENUM_t)M2M2_PM_SYS_STATUS_ERR_ARGS;
          post_office_send(response_mail, &err);
        }
        post_office_consume_msg(pkt);
        break;
      }
#endif // LOW_TOUCH_FEATURE

      case M2M2_PM_SYS_COMMAND_FORCE_STREAM_STOP_REQ: {
        gnForceStopReqAddr = pkt->src; // Update from which src Force stop
                                       // Request was received(ble/usb)
        // Force-stop Sensor streaming that wasn't stopped
        SendForceStopStreaming();
        post_office_consume_msg(pkt);
        break;
      }
#ifdef DCB
      case M2M2_DCB_COMMAND_QUERY_STATUS_REQ: {

        response_mail = post_office_create_msg(
            M2M2_HEADER_SZ + sizeof(m2m2_dcb_block_status_t));
        if (response_mail != NULL) {
          m2m2_dcb_block_status_t *resp =
              (m2m2_dcb_block_status_t *)&response_mail->data[0];

          memset(resp->dcb_blk_array, 0, sizeof(resp->dcb_blk_array));

          // Query & Fill in the DCB Block status currently in the firmware
#ifdef LOW_TOUCH_FEATURE
          resp->dcb_blk_array[ADI_DCB_GENERAL_BLOCK_IDX] =
              gen_blk_get_dcb_present_flag();
          resp->dcb_blk_array[ADI_DCB_LT_APP_LCFG_BLOCK_IDX] =
              lt_app_lcfg_get_dcb_present_flag();
#endif
          resp->dcb_blk_array[ADI_DCB_ADPD4000_BLOCK_IDX] =
              adpd4000_get_dcb_present_flag();
          resp->dcb_blk_array[ADI_DCB_ADXL362_BLOCK_IDX] =
              adxl_get_dcb_present_flag();
#ifdef ENABLE_PPG_APP
          resp->dcb_blk_array[ADI_DCB_PPG_BLOCK_IDX] =
              ppg_get_dcb_present_flag();
#endif
#ifdef ENABLE_ECG_APP
          resp->dcb_blk_array[ADI_DCB_ECG_BLOCK_IDX] =
              ecg_get_dcb_present_flag();
#endif
#ifdef ENABLE_EDA_APP
          resp->dcb_blk_array[ADI_DCB_EDA_BLOCK_IDX] =
              eda_get_dcb_present_flag();
#endif
#ifdef ENABLE_BIA_APP
          resp->dcb_blk_array[ADI_DCB_BIA_BLOCK_IDX] =
              bia_get_dcb_present_flag();
#endif
          resp->dcb_blk_array[ADI_DCB_AD7156_BLOCK_IDX] =
              ad7156_get_dcb_present_flag();
#ifdef USER0_CONFIG_APP
          resp->dcb_blk_array[ADI_DCB_USER0_BLOCK_IDX] =
              user0_blk_get_dcb_present_flag();
#endif
#ifdef ENABLE_TEMPERATURE_APP
          resp->dcb_blk_array[ADI_DCB_TEMPERATURE_BLOCK_IDX] =
              tempr_get_dcb_present_flag();
#endif
          /*Send the response*/
          response_mail->dest = pkt->src;
          response_mail->src = pkt->dest;
          resp->command =
              (M2M2_DCB_COMMAND_ENUM_t)M2M2_DCB_COMMAND_QUERY_STATUS_RESP;
          resp->status =
              M2M2_PM_SYS_STATUS_OK;
          post_office_send(response_mail, &err);
        }
        post_office_consume_msg(pkt);
        break;
      }
#ifdef LOW_TOUCH_FEATURE
      case M2M2_DCB_COMMAND_READ_CONFIG_REQ: {
        response_mail = lt_app_lcfg_dcb_command_read_config(pkt);
        if (response_mail != NULL) {
          post_office_send(response_mail, &err);
        }
        post_office_consume_msg(pkt);
        break;
      }
      case M2M2_DCB_COMMAND_WRITE_CONFIG_REQ: {

        response_mail = lt_app_lcfg_dcb_command_write_config(pkt);
        if (response_mail != NULL) {
          post_office_send(response_mail, &err);
        }
        post_office_consume_msg(pkt);
        break;
      }
      case M2M2_DCB_COMMAND_ERASE_CONFIG_REQ: {

        response_mail = lt_app_lcfg_dcb_command_delete_config(pkt);
        if (response_mail != NULL) {
          post_office_send(response_mail, &err);
        }
        post_office_consume_msg(pkt);
        break;
      }
#endif//LOW_TOUCH_FEATURE
#endif
#ifdef PO_MEM_UTIL_STATS
      case M2M2_PM_SYS_GET_PO_MEMORY_UTILIZATION_REQ: {
        response_mail = post_office_create_msg(
            M2M2_HEADER_SZ + sizeof( m2m2_get_po_memory_utilization_cmd_t));
        if (response_mail != NULL) {
         m2m2_get_po_memory_utilization_cmd_t *get_mem_utilization =
            (m2m2_get_po_memory_utilization_cmd_t *)&response_mail->data[0];
         response_mail->src = pkt->dest;
         response_mail->dest = pkt->src;
         get_mem_utilization->command = M2M2_PM_SYS_GET_PO_MEMORY_UTILIZATION_RESP;
         get_mem_utilization->status = M2M2_PM_SYS_STATUS_OK;
         get_mem_utilization->min_num_free_blks_type2 = min_num_free_blks_type2;
         get_mem_utilization->min_num_free_blks_type4 = min_num_free_blks_type4;
         get_mem_utilization->min_num_free_blks_type5 = min_num_free_blks_type5;
         get_mem_utilization->block_2_allocated = block_2_allocated;
         get_mem_utilization->block_4_allocated = block_4_allocated;
         get_mem_utilization->block_5_allocated = block_5_allocated;
         get_mem_utilization->block_2_freed = block_2_freed;
         get_mem_utilization->block_4_freed = block_4_freed;
         get_mem_utilization->block_5_freed = block_5_freed;
         post_office_send(response_mail, &err);
        }
        post_office_consume_msg(pkt);
        break;
      }
      case M2M2_PM_SYS_CLEAR_PO_MEMORY_UTILIZATION_REQ: {
      response_mail = post_office_create_msg(M2M2_HEADER_SZ + sizeof(m2m2_clear_po_memory_utilization_cmd_t));
        if (response_mail != NULL) {
          m2m2_clear_po_memory_utilization_cmd_t *clear_po_mem_resp =
              (m2m2_clear_po_memory_utilization_cmd_t *)&response_mail->data[0];

          /* send response packet */
          response_mail->src = pkt->dest;
          response_mail->dest = pkt->src;
          clear_po_mem_resp->command =
              (M2M2_APP_COMMON_CMD_ENUM_t)M2M2_PM_SYS_CLEAR_PO_MEMORY_UTILIZATION_RESP;
          clear_po_mem_resp->status =
              (M2M2_APP_COMMON_STATUS_ENUM_t)M2M2_PM_SYS_STATUS_OK;
          post_office_send(response_mail, &err);
        }
        post_office_consume_msg(pkt);
        min_num_free_blks_type2 = MEM_BLK_TYPE2_CNT;
        min_num_free_blks_type4 = MEM_BLK_TYPE4_CNT;
        min_num_free_blks_type5 = MEM_BLK_TYPE5_CNT;
        block_2_allocated=0;
        block_4_allocated=0;
        block_5_allocated=0;
        block_2_freed=0;
        block_4_freed=0;
        block_5_freed=0;
        break;
      }
#endif //PO_MEM_UTIL_STATS

