ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/system/system_task.c
/************************** DCB for LT_APP_LCFG_BLOCK **************************/

#ifdef DCB
/**
 * @brief  Function which handles the m2m2 command to do lt_app_lcfg_dcb read
 * @param  p_pkt m2m2 REQ packet
 * @return m2m2 RESP packet
 */
static m2m2_hdr_t *lt_app_lcfg_dcb_command_read_config(m2m2_hdr_t *p_pkt)
{
    static uint16_t r_size = 0;
    uint32_t dcbdata[MAXLTAPPLCFGDCBSIZE];
    M2M2_DCB_STATUS_ENUM_t status = M2M2_DCB_STATUS_ERR_NOT_CHKD;

    PKT_MALLOC(p_resp_pkt, m2m2_dcb_lt_app_lcfg_data_t, 0);
    if(p_resp_pkt != NULL) {
      // Declare a pointer to the response packet payload
      PYLD_CST(p_resp_pkt, m2m2_dcb_lt_app_lcfg_data_t, p_resp_payload);

      r_size = (uint16_t)MAXLTAPPLCFGDCBSIZE;
      if(read_lt_app_lcfg_dcb(&dcbdata[0],&r_size) == LT_APP_LCFG_DCB_STATUS_OK)
      {
          for(int i=0; i< r_size; i++){
            p_resp_payload->dcbdata[i] = dcbdata[i];
          }
          p_resp_payload->size = (r_size);
          status = M2M2_DCB_STATUS_OK;
      }
      else
      {
          p_resp_payload->size = 0;
          status = M2M2_DCB_STATUS_ERR_ARGS;
      }

      p_resp_payload->status = status;
      p_resp_payload->command = M2M2_DCB_COMMAND_READ_CONFIG_RESP;
      p_resp_pkt->src = p_pkt->dest;
      p_resp_pkt->dest = p_pkt->src;
    }
    return p_resp_pkt;
}

/**
 * @brief  Function which handles the m2m2 command to do lt_app_lcfg_dcb write
 * @param  p_pkt m2m2 REQ packet
 * @return m2m2 RESP packet
 */
static m2m2_hdr_t *lt_app_lcfg_dcb_command_write_config(m2m2_hdr_t *p_pkt)
{
    M2M2_DCB_STATUS_ENUM_t status = M2M2_DCB_STATUS_ERR_NOT_CHKD;
    uint32_t dcbdata[MAXLTAPPLCFGDCBSIZE];

    // Declare a pointer to access the input packet payload
    PYLD_CST(p_pkt, m2m2_dcb_lt_app_lcfg_data_t, p_in_payload);
    PKT_MALLOC(p_resp_pkt, m2m2_dcb_lt_app_lcfg_data_t, 0);

    if(p_resp_pkt != NULL) {
      // Declare a pointer to the response packet payload
      PYLD_CST(p_resp_pkt, m2m2_dcb_lt_app_lcfg_data_t, p_resp_payload);

      for(int i=0; i<p_in_payload->size; i++) {
        dcbdata[i] = p_in_payload->dcbdata[i];
      }
      if(write_lt_app_lcfg_dcb(&dcbdata[0],p_in_payload->size) == LT_APP_LCFG_DCB_STATUS_OK)
      {
          lt_app_lcfg_set_dcb_present_flag(true);
          lt_app_lcfg_set_from_dcb();
#ifdef CUST4_SM
          if(get_low_touch_trigger_mode3_status())
          {
            dis_page_jump(&page_watch_id);
          }
          else
          {
            dis_page_jump(&page_menu);
          }
#endif
          status = M2M2_DCB_STATUS_OK;
      }
      else
      {
          status = M2M2_DCB_STATUS_ERR_ARGS;
      }

      p_resp_payload->status = status;
      p_resp_payload->command = M2M2_DCB_COMMAND_WRITE_CONFIG_RESP;
      p_resp_payload->size = 0;
      for(uint16_t i=0; i< MAXLTAPPLCFGDCBSIZE; i++) {
        p_resp_payload->dcbdata[i] = 0;
      }
      p_resp_pkt->src = p_pkt->dest;
      p_resp_pkt->dest = p_pkt->src;
    }
    return p_resp_pkt;
}

/**
 * @brief  Function which handles the m2m2 command to do lt_app_lcfg_dcb delete
 * @param  p_pkt m2m2 REQ packet
 * @return m2m2 RESP packet
 */
static m2m2_hdr_t *lt_app_lcfg_dcb_command_delete_config(m2m2_hdr_t *p_pkt)
{
    M2M2_DCB_STATUS_ENUM_t status = M2M2_DCB_STATUS_ERR_NOT_CHKD;

    PKT_MALLOC(p_resp_pkt, m2m2_dcb_lt_app_lcfg_data_t, 0);

    if(p_resp_pkt != NULL) {
      // Declare a pointer to the response packet payload
      PYLD_CST(p_resp_pkt, m2m2_dcb_lt_app_lcfg_data_t, p_resp_payload);

      if(delete_lt_app_lcfg_dcb() == LT_APP_LCFG_DCB_STATUS_OK)
      {
          lt_app_lcfg_set_dcb_present_flag(false);
          lt_app_lcfg_set_fw_default();
#ifdef CUST4_SM
          if(get_low_touch_trigger_mode3_status())
          {
            dis_page_jump(&page_watch_id);
          }
          else
          {
            dis_page_jump(&page_menu);
          }
#endif
          status = M2M2_DCB_STATUS_OK;
      }
      else
      {
          status = M2M2_DCB_STATUS_ERR_ARGS;
      }

      p_resp_payload->status = status;
      p_resp_payload->command = M2M2_DCB_COMMAND_ERASE_CONFIG_RESP;
      p_resp_payload->size = 0;
      for(uint16_t i=0; i< MAXLTAPPLCFGDCBSIZE; i++) {
        p_resp_payload->dcbdata[i] = 0;
      }
      p_resp_pkt->src = p_pkt->dest;
      p_resp_pkt->dest = p_pkt->src;
    }
    return p_resp_pkt;

}
#endif // DCB
/*@}*/  /* end of group system_task */
/**@}*/ /* end of group Tasks */